# https://github.com/Homebrew/homebrew-bundle

tap 'caskroom/cask'
tap 'getantibody/antibody'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/science'
tap 'homebrew/services'
tap 'homebrew/versions'
tap 'homebrew/python'
# tap 'homebrew/fuse'
# tap 'neovim/neovim'
# tap 'synack/docker'

# https://github.com/mas-cli/mas
brew 'mas'
brew 'openssl'
brew 'readline'
brew 'sqlite'
brew 'aircrack-ng'
brew 'ant'
brew 'aria2'
brew 'autoconf'
brew 'automake'
brew 'bash-completion'
brew 'c-ares'
brew 'ghc'
brew 'cabal-install'
brew 'cheat'
brew 'libsigsegv'
brew 'clisp'
brew 'cloc'
brew 'gmp'
brew 'isl'
brew 'cloog'
brew 'cmake'
brew 'faad2'
brew 'flac'
brew 'libao'
brew 'libcue'
brew 'libogg'
brew 'libvorbis'
brew 'mad'
brew 'mp4v2'
brew 'cmus'
brew 'coreutils'
brew 'cscope'
brew 'ctags'
brew 'curl'
brew 'dbus'
brew 'diff-so-fancy'
brew 'libgpg-error'
brew 'libassuan'
brew 'libgcrypt'
brew 'libksba'
brew 'pth'
brew 'dirmngr'
brew 'eigen'
brew 'emacs'
brew 'extract_url'
brew 'fdupes'
brew 'lame'
brew 'git'
brew 'x264'
brew 'xvid'
brew 'ffmpeg'
brew 'findutils'
brew 'fpp'
brew 'libpng'
brew 'freetype'
brew 'fzf'
brew 'mpfr'
brew 'libmpc'
brew 'gcc'
brew 'gdb'
brew 'gdbm'
brew 'geoip'
brew 'gettext'
brew 'git-extras'
brew 'git-flow'
brew 'libffi'
brew 'pcre'
brew 'glib'
brew 'gnupg'
brew 'pinentry'
brew 'gpg-agent'
brew 'libusb'
brew 'libusb-compat'
brew 'gnupg2'
brew 'libtasn1'
brew 'nettle'
brew 'gnutls'
brew 'go'
brew 'xz'
brew 'python3'
brew 'googler'
brew 'gotags'
brew 'gpgme'
brew 'haproxy'
brew 'haskell-stack'
brew 'htop'
brew 'hub'
brew 'ilmbase'
brew 'jpeg'
brew 'oniguruma'
brew 'jq'
brew 'json-c'
brew 'kubernetes-cli'
brew 'leiningen'
brew 'libevent'
brew 'libssh2'
brew 'libgit2'
brew 'libid3tag'
brew 'libsamplerate'
brew 'libsndfile'
brew 'libsoxr'
brew 'libtiff'
brew 'libtool'
brew 'libyaml'
brew 'lua'
brew 'python'
brew 'makedepend'
brew 'masscan'
brew 'mercurial'
brew 'mitmproxy'
brew 'monit'
brew 'mp3wrap'
brew 'mpg123'
brew 'mtr'
brew 'n'
brew 'ninja'
brew 'nmap'
brew 'nvm'
brew 'openexr'
brew 'p7zip'
brew 'peco'
brew 'perl'
brew 'pkg-config'
brew 'polipo', restart_service: true
brew 'portaudio'
brew 'proxychains-ng'
brew 'pstree'
brew 'pulseaudio'
brew 'pup'
brew 'pv'
brew 'qt5'
brew 'ruby-build'
brew 'rbenv'
brew 'rbenv-gemset'
brew 'reattach-to-user-namespace'
brew 'redsocks'
brew 'rlwrap'
brew 'rmtrash'
brew 'ruby'
brew 'rust'
brew 'sbcl'
brew 'sphinx-doc'
brew 'ssh-copy-id'
brew 'stow'
brew 'the_silver_searcher'
brew 'todo-txt'
brew 'tor'
brew 'tree'
brew 'valgrind'
brew 'vim'
brew 'wget'
brew 'wireshark', args: ['with-qt5']
brew 'wrk'
brew 'wxmac'
brew 'youtube-dl'
brew 'z'
brew 'zsh'
brew 'getantibody/antibody/antibody'
brew 'homebrew/dupes/rsync'
# brew 'homebrew/fuse/ntfs-3g'
# brew 'homebrew/fuse/sshfs'
# brew 'homebrew/fuse/tup'
brew 'homebrew/python/numpy'
brew 'homebrew/science/opencv'
cask 'firefox'
cask 'google-drive'
# cask 'genymotion'
# cask 'hammerspoon'
cask 'iterm2'
cask 'macdown'
cask 'mplayerx'
cask 'telegram'
cask 'vagrant'
cask 'virtualbox'
cask 'xquartz'
