###
#
# https://github.com/Homebrew/homebrew-bundle
# https://github.com/mas-cli/mas
#
### applications
#
# https://github.com/karan/joe
# https://github.com/banbanchs/pan-baidu-download
#
###

tap "caskroom/cask"
tap "caskroom/fonts"
tap "getantibody/antibody"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/python"
tap "homebrew/science"
tap "homebrew/services"
tap "homebrew/versions"
cask "xquartz"
brew "openssl"
brew "sqlite"
brew "aircrack-ng"
brew "ant"
brew "aria2"
brew "clasp"
brew "gringo"
brew "aspcud"
brew "autoconf"
brew "automake"
brew "bash-completion"
brew "bfg"
brew "c-ares"
brew "ghc"
brew "cabal-install"
brew "ocaml"
brew "ocamlbuild"
brew "camlp4"
brew "cheat"
brew "libsigsegv"
brew "clisp"
brew "cloc"
brew "gmp@4"
brew "isl@0.12"
brew "cloog"
brew "cmake"
brew "faad2"
brew "flac"
brew "libao"
brew "libcue"
brew "libogg"
brew "libvorbis"
brew "mad"
brew "mp4v2"
brew "cmus"
brew "coreutils"
brew "cscope"
brew "ctags"
brew "ctop"
brew "curl"
brew "dbus"
brew "diff-so-fancy"
brew "pth"
brew "dirmngr"
brew "docker-clean"
brew "git"
brew "docker-machine"
brew "libev"
brew "opam"
brew "docker-machine-driver-xhyve"
brew "eigen"
brew "emacs"
brew "extract_url"
brew "fdupes"
brew "lame"
brew "x264"
brew "xvid"
brew "ffmpeg"
brew "findutils"
brew "fish"
brew "fpp"
brew "libpng"
brew "freetype"
brew "fswatch"
brew "fzf"
brew "isl"
brew "mpfr"
brew "libmpc"
brew "gcc"
brew "gdb"
brew "geoip"
brew "gettext"
brew "git-extras"
brew "git-flow"
brew "glib"
brew "pinentry"
brew "gnupg"
brew "go"
brew "python3"
brew "googler"
brew "gor"
brew "gotags"
brew "gpg-agent"
brew "gpgme"
brew "haskell-stack"
brew "htop"
brew "httpie"
brew "hub"
brew "ilmbase"
brew "jpeg"
brew "oniguruma"
brew "jq"
brew "json-c"
brew "kubernetes-cli"
brew "leiningen"
brew "libevent"
brew "libssh2"
brew "libgit2"
brew "libid3tag"
brew "libsamplerate"
brew "libsndfile"
brew "libsoxr"
brew "libtermkey"
brew "libtiff"
brew "libtool"
brew "libusb-compat"
brew "libyaml"
brew "lua"
brew "makedepend"
brew "mas"
brew "masscan"
brew "python"
brew "mercurial"
brew "mitmproxy"
brew "monit"
brew "mp3wrap"
brew "mpg123"
brew "mtr"
brew "n"
brew "ninja"
brew "nmap"
brew "numpy"
brew "openexr"
brew "p7zip"
brew "peco"
brew "perl"
brew "pkg-config"
brew "polipo", restart_service: true
brew "portaudio"
brew "proxychains-ng"
brew "pstree"
brew "pulseaudio"
brew "pup"
brew "pv"
brew "qt"
brew "reattach-to-user-namespace"
brew "redsocks"
brew "rlwrap"
brew "rmtrash"
brew "rsync"
brew "rtv"
brew "rust"
brew "sbcl"
brew "shellcheck"
brew "sphinx-doc"
brew "ssh-copy-id"
brew "stow"
brew "the_silver_searcher"
brew "tmux"
brew "todo-txt"
brew "tor"
brew "tree"
brew "valgrind"
brew "vim"
brew "watchman"
brew "weechat"
brew "wget"
brew "wireshark", args: ["with-qt"]
brew "wrk"
brew "wxmac"
brew "youtube-dl"
brew "z"
brew "zsh"
brew "getantibody/antibody/antibody"
brew "homebrew/science/opencv"
cask "anybar"
cask "atom"
cask "brave"
cask "firefox"
cask "font-hack"
cask "genymotion"
cask "google-drive"
cask "hammerspoon"
cask "intellij-idea-ce"
cask "iterm2"
cask "keeweb"
cask "kindlegen"
cask "macdown"
cask "mplayerx"
cask "pycharm-ce"
cask "robomongo"
cask "spectacle"
cask "torbrowser"
cask "tunnelblick"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "iPhoto", id: 408981381
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "QQ", id: 451108668
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
mas "有道词典", id: 491854842
