###
#
# https://github.com/Homebrew/homebrew-bundle
# https://github.com/mas-cli/mas
#
### applications
#
# https://github.com/yujitach/MenuMeters
# https://github.com/karan/joe
# https://github.com/banbanchs/pan-baidu-download
#
###

tap "caskroom/cask"
tap "bundle"
cask "xquartz"
brew "openssl"
brew "sqlite"
brew "ant"
brew "aria2"
brew "clasp"
brew "gringo"
brew "aspcud"
brew "autoconf"
brew "automake"
brew "bash-completion"
brew "bfg"
brew "c-ares"
brew "ghc"
brew "camlp4"
brew "cheat"
brew "libsigsegv"
brew "clisp"
brew "cloc"
brew "cloog"
brew "cmake"
brew "faad2"
brew "flac"
brew "libao"
brew "libcue"
brew "libogg"
brew "libvorbis"
brew "mad"
brew "mp4v2"
brew "cmus"
brew "coreutils"
brew "cscope"
brew "ctags"
brew "ctop"
brew "curl"
brew "dbus"
brew "diff-so-fancy"
brew "pth"
brew "docker-clean"
brew "git"
brew "libev"
brew "opam"
brew "eigen"
brew "emacs"
brew "extract_url"
brew "fdupes"
brew "fd"
brew "lame"
brew "xvid"
brew "ffmpeg"
brew "findutils"
brew "fpp"
brew "libpng"
brew "freetype"
brew "fswatch"
brew "fzf"
brew "isl"
brew "mpfr"
brew "libmpc"
brew "gcc"
brew "gdb"
brew "geoip"
brew "gettext"
brew "git-extras"
brew "glib"
brew "pinentry"
brew "gnupg"
brew "go"
brew "python3"
brew "googler"
brew "gor"
brew "gotags"
brew "gpg-agent"
brew "gpgme"
brew "haskell-stack"
brew "htop"
brew "httpie"
brew "hub"
brew "ilmbase"
brew "jpeg"
brew "oniguruma"
brew "jq"
brew "libevent"
brew "libssh2"
brew "libgit2"
brew "libid3tag"
brew "libsamplerate"
brew "libsndfile"
brew "libsoxr"
brew "libtermkey"
brew "libtiff"
brew "libtool"
brew "libusb-compat"
brew "libyaml"
brew "lua"
brew "makedepend"
brew "mas"
brew "masscan"
brew "python"
brew "mercurial"
brew "mitmproxy"
brew "monit"
brew "mp3wrap"
brew "mpg123"
brew "mtr"
brew "n"
brew "ninja"
brew "nmap"
brew "openexr"
brew "p7zip"
brew "peco"
brew "perl"
brew "pkg-config"
brew "polipo", restart_service: true
brew "portaudio"
brew "proxychains-ng"
brew "pstree"
brew "pulseaudio"
brew "pup"
brew "pv"
brew "reattach-to-user-namespace"
brew "rlwrap"
brew "rmtrash"
brew "rsync"
brew "rtv"
brew "sbcl"
brew "shellcheck"
brew "sphinx-doc"
brew "ssh-copy-id"
brew "stow"
brew "the_silver_searcher"
brew "rg"
brew "tree"
brew "valgrind"
brew "vim"
brew "watchman"
brew "wget"
brew "wireshark", args: ["with-qt"]
brew "wrk"
brew "wxmac"
brew "youtube-dl"
brew "z"
brew "zsh"
cask "vagrant"
cask "virtualbox"
